# InaccurateDriveCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InaccurateFailures..::..InaccurateDriveCurve Property
BuiltInFailures..::..InaccurateFailures Class See Also
---
Element is slightly off axis and may cause inaccuracies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InaccurateDriveCurve { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InaccurateDriveCurve As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InaccurateDriveCurve {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InaccurateFailures Class
Autodesk.Revit.DB Namespace